wodecoin/mm32f5270_nano_frame/base/library/MM32F5270/HAL_Lib/Inc/hal_enet.h
/***********************************************************************************************************************
    @file     hal_enet.h
    @author   VV TEAM
    @brief    THIS FILE CONTAINS ALL THE FUNCTIONS PROTOTYPES FOR THE ETH
              FIRMWARE LIBRARY.
  **********************************************************************************************************************
    @attention

    <h2><center>&copy; Copyright(c) <2023> <MindMotion></center></h2>

      Redistribution and use in source and binary forms, with or without modification, are permitted provided that the
    following conditions are met:
    1. Redistributions of source code must retain the above copyright notice,
       this list of conditions and the following disclaimer.
    2. Redistributions in binary form must reproduce the above copyright notice, this list of conditions and
       the following disclaimer in the documentation and/or other materials provided with the distribution.
    3. Neither the name of the copyright holder nor the names of its contributors may be used to endorse or
       promote products derived from this software without specific prior written permission.

      THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES,
    INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
    DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL,
    SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
    SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
    WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
    OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *********************************************************************************************************************/

#ifndef __HAL_ETH_H
#define __HAL_ETH_H

#include "mm32_device.h"

#define DP83848

#ifdef CUSTOM_DRIVER_BUFFERS_CONFIG
#define ETH_RX_BUF_SIZE                                     ETH_MAX_PACKET_SIZE
#define ETH_TX_BUF_SIZE                                     ETH_MAX_PACKET_SIZE
#define ETH_RX_BUF_NUM                                      4
#define ETH_TX_BUF_NUM                                      4
#endif

////////////////////////////////////////////////////////////////////////////////
#if defined (DP83848)
#define PHY_SR                                              ((uint16_t)0x10)
#define PHY_SR_LINKSTATUS                                   ((uint16_t)0x0001)
#define PHY_SPEED_STATUS                                    ((uint16_t)0x0002)
#define PHY_DUPLEX_STATUS                                   ((uint16_t)0x0004)

#define PHY_MICR                                            ((uint16_t)0x11)
#define PHY_MICR_INT_EN                                     ((uint16_t)0x0002)
#define PHY_MICR_INT_OE                                     ((uint16_t)0x0001)

#define PHY_MISR                                            ((uint16_t)0x12)
#define PHY_MISR_LINK_INT_EN                                ((uint16_t)0x0020)
#define PHY_LINK_STATUS                                     ((uint16_t)0x2000)
#endif

#define ETH_MAX_PACKET_SIZE                                 1524
#define ETH_HEADER                                          14 ///< MAC Dest Addr 6 byte + MAC Src Addr 6 byte + Lenth/Type 2 byte
#define ETH_EXTRA                                           2
#define VLAN_TAG                                            4
#define ETH_PAYLOAD_MIN                                     46
#define ETH_PAYLOAD_MAX                                     1500
#define JUMBO_FRAME_PAYLOAD                                 9000

#ifndef ETH_RX_BUF_SIZE
#define ETH_RX_BUF_SIZE                                     ETH_MAX_PACKET_SIZE
#endif

#ifndef ETH_RX_BUF_NUM
#define ETH_RX_BUF_NUM                                      4
#endif

#ifndef ETH_TX_BUF_SIZE
#define ETH_TX_BUF_SIZE                                     ETH_MAX_PACKET_SIZE
#endif

#ifndef ETH_TX_BUF_NUM
#define ETH_TX_BUF_NUM                                      4
#endif

#define ETH_DMA_RDES_FL_Pos                                 16 ///< Ethernet DMA Received Frame Length Position

#define ETH_WAKEUP_REGISTER_LENGTH                          8  ///< ETHERNET Remote Wake-up frame register length

#define ETH_DMA_RX_OVERFLOW_MISSEDFRAMES_COUNTERSHIFT       17 ///< ETHERNET Missed frames counter Shift

#define ETH_DMA_TDES_COLLISION_COUNTSHIFT                   3  ///< ETHERNET DMA Tx descriptors Collision Count Shift
#define ETH_DMA_TDES_BUFFER2_SIZESHIFT                      11 ///< ETHERNET DMA Tx descriptors Buffer2 Size Shift

#define ETH_DMA_RDES_FRAME_LENGTHSHIFT                      16 ///< ETHERNET DMA Rx descriptors Frame Length Shift
#define ETH_DMA_RDES_BUFFER2_SIZESHIFT                      11 ///< ETHERNET DMA Rx descriptors Buffer2 Size Shift

#define ETH_ERROR                                           ((uint32_t)0)
#define ETH_SUCCESS                                         ((uint32_t)1)

/**
  * @brief ETH Init Structure Definition
  */
typedef struct
{
    __IO uint32_t    ETH_AutoNegotiation;
    __IO uint32_t    ETH_Watchdog;
    __IO uint32_t    ETH_Jabber;
    __IO uint32_t    ETH_InterFrameGap;
    __IO uint32_t    ETH_CarrierSense;
    __IO uint32_t    ETH_Speed;
    __IO uint32_t    ETH_ReceiveOwn;
    __IO uint32_t    ETH_LoopbackMode;
    __IO uint32_t    ETH_Mode;
    __IO uint32_t    ETH_ChecksumOffload;
    __IO uint32_t    ETH_RetryTransmission;
    __IO uint32_t    ETH_AutomaticPadCRCStrip;
    __IO uint32_t    ETH_BackOffLimit;
    __IO uint32_t    ETH_DeferralCheck;
    __IO uint32_t    ETH_ReceiveAll;
    __IO uint32_t    ETH_SourceAddrFilter;
    __IO uint32_t    ETH_PassControlFrames;
    __IO uint32_t    ETH_BroadcastFramesReception;
    __IO uint32_t    ETH_DestinationAddrFilter;
    __IO uint32_t    ETH_PromiscuousMode;
    __IO uint32_t    ETH_MulticastFramesFilter;
    __IO uint32_t    ETH_UnicastFramesFilter;
    __IO uint32_t    ETH_HashTableHigh;
    __IO uint32_t    ETH_HashTableLow;
    __IO uint32_t    ETH_PauseTime;
    __IO uint32_t    ETH_ZeroQuantaPause;
    __IO uint32_t    ETH_PauseLowThreshold;
    __IO uint32_t    ETH_UnicastPauseFrameDetect;
    __IO uint32_t    ETH_ReceiveFlowControl;
    __IO uint32_t    ETH_TransmitFlowControl;
    __IO uint32_t    ETH_VLANTagComparison;
    __IO uint32_t    ETH_VLANTagIdentifier;
    __IO uint32_t    ETH_DropTCPIPChecksumErrorFrame;
    __IO uint32_t    ETH_ReceiveStoreForward;
    __IO uint32_t    ETH_FlushReceivedFrame;
    __IO uint32_t    ETH_TransmitStoreForward;
    __IO uint32_t    ETH_TransmitThresholdControl;
    __IO uint32_t    ETH_ForwardErrorFrames;
    __IO uint32_t    ETH_ForwardUndersizedGoodFrames;
    __IO uint32_t    ETH_ReceiveThresholdControl;
    __IO uint32_t    ETH_SecondFrameOperate;
    __IO uint32_t    ETH_AddressAlignedBeats;
    __IO uint32_t    ETH_FixedBurst;
    __IO uint32_t    ETH_RxDMABurstLength;
    __IO uint32_t    ETH_TxDMABurstLength;
    __IO uint32_t    ETH_DescriptorSkipLength;
    __IO uint32_t    ETH_DMAArbitration;
} ETH_InitTypeDef;

typedef struct
{
    __IO uint32_t        CS;             ///< Control and Status
    __IO uint32_t        BL;             ///< Buffer1, Buffer2 lengths
    __IO uint32_t        BUF1ADDR;       ///< Buffer1 address pointer
    __IO uint32_t        BUF2NDADDR;     ///< Buffer2 or next descriptor address pointer

#ifdef USE_ENHANCED_DMA_DESCRIPTORS      ///< Enhanced ETHERNET DMA PTP Descriptors
    __IO uint32_t        ExtendedStatus; ///< Extended status for PTP receive descriptor
    __IO uint32_t        Reserved1;      ///< Reserved
    __IO uint32_t        TimeStampLow;   ///< Time Stamp Low value for transmit and receive
    __IO uint32_t        TimeStampHigh;  ///< Time Stamp High value for transmit and receive
#endif
} ETH_DMADESCTypeDef;

typedef struct
{
    __IO uint32_t                            len;
    __IO uint32_t                            buf;
    __IO ETH_DMADESCTypeDef                 *ptrDesc;
} FrameTypeDef;

typedef struct
{
    __IO ETH_DMADESCTypeDef                 *ptrFS_Rx_Desc;                     ///< First Segment Rx Desc
    __IO ETH_DMADESCTypeDef                 *ptrLS_Rx_Desc;                     ///< Last Segment Rx Desc
    __IO uint32_t                            cnt;                               ///< Segment count
} ETH_DMA_Rx_Frame_infos;

#define ETH_DMA_TDES_OWN                                 ((uint32_t)0x80000000) ///< OWN bit: descriptor is owned by DMA engine
#define ETH_DMA_TDES_ES                                  ((uint32_t)0x00008000) ///< Error summary: OR of the following bits: UE || ED || EC || LCO || NC || LCA || FF || JT
#define ETH_DMA_TDES_JT                                  ((uint32_t)0x00004000) ///< Jabber Timeout
#define ETH_DMA_TDES_FF                                  ((uint32_t)0x00002000) ///< Frame Flushed: DMA/MTL flushed the frame due to SW flush
#define ETH_DMA_TDES_LCA                                 ((uint32_t)0x00000800) ///< Loss of Carrier: carrier lost during transmission
#define ETH_DMA_TDES_NC                                  ((uint32_t)0x00000400) ///< No Carrier: no carrier signal from the transceiver
#define ETH_DMA_TDES_LCO                                 ((uint32_t)0x00000200) ///< Late Collision: transmission aborted due to collision
#define ETH_DMA_TDES_EC                                  ((uint32_t)0x00000100) ///< Excessive Collision: transmission aborted after 16 collisions
#define ETH_DMA_TDES_VF                                  ((uint32_t)0x00000080) ///< VLAN Frame
#define ETH_DMA_TDES_CC                                  ((uint32_t)0x00000078) ///< Collision Count
#define ETH_DMA_TDES_ED                                  ((uint32_t)0x00000004) ///< Excessive Deferral
#define ETH_DMA_TDES_UF                                  ((uint32_t)0x00000002) ///< Underflow Error: late data arrival from the memory
#define ETH_DMA_TDES_DB                                  ((uint32_t)0x00000001) ///< Deferred Bit

#define ETH_DMA_TDES_IC                                  ((uint32_t)0x80000000) ///< Interrupt on Completion
#define ETH_DMA_TDES_LS                                  ((uint32_t)0x40000000) ///< Last Segment
#define ETH_DMA_TDES_FS                                  ((uint32_t)0x20000000) ///< First Segment
#define ETH_DMA_TDES_DC                                  ((uint32_t)0x04000000) ///< Disable CRC
#define ETH_DMA_TDES_TER                                 ((uint32_t)0x02000000) ///< Transmit end of ring
#define ETH_DMA_TDES_TCH                                 ((uint32_t)0x01000000) ///< Second Address Chained
#define ETH_DMA_TDES_DP                                  ((uint32_t)0x00800000) ///< Disable Padding
#define ETH_DMA_TDES_TBS2                                ((uint32_t)0x003FF800) ///< Transmit Buffer 2 Size
#define ETH_DMA_TDES_TBS1                                ((uint32_t)0x000007FF) ///< Transmit Buffer 1 Size

