wodecoin/mm32f5270_nano_frame/base/library/MM32F5270/HAL_Lib/Inc/hal_enet.h
#define ETH_Jabber_Enable                                ((uint32_t)0x00000000)
#define ETH_Jabber_Disable                               ((uint32_t)0x00400000)

#define ETH_InterFrameGap_96Bit                          ((uint32_t)0x00000000) ///< minimum IFG between frames during transmission is 96Bit
#define ETH_InterFrameGap_88Bit                          ((uint32_t)0x00020000) ///< minimum IFG between frames during transmission is 88Bit
#define ETH_InterFrameGap_80Bit                          ((uint32_t)0x00040000) ///< minimum IFG between frames during transmission is 80Bit
#define ETH_InterFrameGap_72Bit                          ((uint32_t)0x00060000) ///< minimum IFG between frames during transmission is 72Bit
#define ETH_InterFrameGap_64Bit                          ((uint32_t)0x00080000) ///< minimum IFG between frames during transmission is 64Bit
#define ETH_InterFrameGap_56Bit                          ((uint32_t)0x000A0000) ///< minimum IFG between frames during transmission is 56Bit
#define ETH_InterFrameGap_48Bit                          ((uint32_t)0x000C0000) ///< minimum IFG between frames during transmission is 48Bit
#define ETH_InterFrameGap_40Bit                          ((uint32_t)0x000E0000) ///< minimum IFG between frames during transmission is 40Bit

#define ETH_CarrierSense_Enable                          ((uint32_t)0x00000000)
#define ETH_CarrierSense_Disable                         ((uint32_t)0x00010000)

#define ETH_Speed_10M                                    ((uint32_t)0x00000000)
#define ETH_Speed_100M                                   ((uint32_t)0x00004000)

#define ETH_ReceiveOwn_Enable                            ((uint32_t)0x00000000)
#define ETH_ReceiveOwn_Disable                           ((uint32_t)0x00002000)

#define ETH_LoopbackMode_Enable                          ((uint32_t)0x00001000)
#define ETH_LoopbackMode_Disable                         ((uint32_t)0x00000000)

#define ETH_Mode_FullDuplex                              ((uint32_t)0x00000800)
#define ETH_Mode_HalfDuplex                              ((uint32_t)0x00000000)

#define ETH_ChecksumOffload_Enable                       ((uint32_t)0x00000400)
#define ETH_ChecksumOffload_Disable                      ((uint32_t)0x00000000)

#define ETH_RetryTransmission_Enable                     ((uint32_t)0x00000000)
#define ETH_RetryTransmission_Disable                    ((uint32_t)0x00000200)

#define ETH_AutomaticPadCRCStrip_Enable                  ((uint32_t)0x00000080)
#define ETH_AutomaticPadCRCStrip_Disable                 ((uint32_t)0x00000000)

#define ETH_BackOffLimit_10                              ((uint32_t)0x00000000)
#define ETH_BackOffLimit_8                               ((uint32_t)0x00000020)
#define ETH_BackOffLimit_4                               ((uint32_t)0x00000040)
#define ETH_BackOffLimit_1                               ((uint32_t)0x00000060)

#define ETH_DeferralCheck_Enable                         ((uint32_t)0x00000010)
#define ETH_DeferralCheck_Disable                        ((uint32_t)0x00000000)

#define ETH_ReceiveAll_Enable                            ((uint32_t)0x80000000)
#define ETH_ReceiveAll_Disable                           ((uint32_t)0x00000000)

#define ETH_SourceAddrFilter_Normal_Enable               ((uint32_t)0x00000200)
#define ETH_SourceAddrFilter_Inverse_Enable              ((uint32_t)0x00000300)
#define ETH_SourceAddrFilter_Disable                     ((uint32_t)0x00000000)

#define ETH_PassControlFrames_BlockAll                   ((uint32_t)0x00000040) ///< MAC filters all control frames from reaching the application
#define ETH_PassControlFrames_ForwardAll                 ((uint32_t)0x00000080) ///< MAC forwards all control frames to application even if they fail the Address Filter
#define ETH_PassControlFrames_ForwardPassedAddrFilter    ((uint32_t)0x000000C0) ///< MAC forwards control frames that pass the Address Filter.

#define ETH_BroadcastFramesReception_Enable              ((uint32_t)0x00000000)
#define ETH_BroadcastFramesReception_Disable             ((uint32_t)0x00000020)

#define ETH_DestinationAddrFilter_Normal                 ((uint32_t)0x00000000)
#define ETH_DestinationAddrFilter_Inverse                ((uint32_t)0x00000008)

#define ETH_PromiscuousMode_Enable                       ((uint32_t)0x00000001)
#define ETH_PromiscuousMode_Disable                      ((uint32_t)0x00000000)

#define ETH_MulticastFramesFilter_PerfectHashTable       ((uint32_t)0x00000404)
#define ETH_MulticastFramesFilter_HashTable              ((uint32_t)0x00000004)
#define ETH_MulticastFramesFilter_Perfect                ((uint32_t)0x00000000)
#define ETH_MulticastFramesFilter_None                   ((uint32_t)0x00000010)

#define ETH_UnicastFramesFilter_PerfectHashTable         ((uint32_t)0x00000402)
#define ETH_UnicastFramesFilter_HashTable                ((uint32_t)0x00000002)
#define ETH_UnicastFramesFilter_Perfect                  ((uint32_t)0x00000000)

#define ETH_ZeroQuantaPause_Enable                       ((uint32_t)0x00000000)
#define ETH_ZeroQuantaPause_Disable                      ((uint32_t)0x00000080)

#define ETH_PauseLowThreshold_Minus4                     ((uint32_t)0x00000000) ///< Pause time minus 4 slot times
#define ETH_PauseLowThreshold_Minus28                    ((uint32_t)0x00000010) ///< Pause time minus 28 slot times
#define ETH_PauseLowThreshold_Minus144                   ((uint32_t)0x00000020) ///< Pause time minus 144 slot times
#define ETH_PauseLowThreshold_Minus256                   ((uint32_t)0x00000030) ///< Pause time minus 256 slot times

#define ETH_UnicastPauseFrameDetect_Enable               ((uint32_t)0x00000008)
#define ETH_UnicastPauseFrameDetect_Disable              ((uint32_t)0x00000000)

#define ETH_ReceiveFlowControl_Enable                    ((uint32_t)0x00000004)
#define ETH_ReceiveFlowControl_Disable                   ((uint32_t)0x00000000)

#define ETH_TransmitFlowControl_Enable                   ((uint32_t)0x00000002)
#define ETH_TransmitFlowControl_Disable                  ((uint32_t)0x00000000)

#define ETH_VLANTagComparison_12Bit                      ((uint32_t)0x00010000)
#define ETH_VLANTagComparison_16Bit                      ((uint32_t)0x00000000)

#define ETH_MAC_FLAG_TST                                 ((uint32_t)0x00000200) ///< Time stamp trigger flag (on MAC)
#define ETH_MAC_FLAG_MMCT                                ((uint32_t)0x00000040) ///< MMC transmit flag
#define ETH_MAC_FLAG_MMCR                                ((uint32_t)0x00000020) ///< MMC receive flag
#define ETH_MAC_FLAG_MMC                                 ((uint32_t)0x00000010) ///< MMC flag (on MAC)
#define ETH_MAC_FLAG_PMT                                 ((uint32_t)0x00000008) ///< PMT flag (on MAC)

#define ETH_MAC_IT_TST                                   ((uint32_t)0x00000200) ///< Time stamp trigger interrupt (on MAC)
#define ETH_MAC_IT_MMCT                                  ((uint32_t)0x00000040) ///< MMC transmit interrupt
#define ETH_MAC_IT_MMCR                                  ((uint32_t)0x00000020) ///< MMC receive interrupt
#define ETH_MAC_IT_MMC                                   ((uint32_t)0x00000010) ///< MMC interrupt (on MAC)
#define ETH_MAC_IT_PMT                                   ((uint32_t)0x00000008) ///< PMT interrupt (on MAC)

#define ETH_MAC_Address0                                 ((uint32_t)0x00000000)
#define ETH_MAC_Address1                                 ((uint32_t)0x00000008)
#define ETH_MAC_Address2                                 ((uint32_t)0x00000010)
#define ETH_MAC_Address3                                 ((uint32_t)0x00000018)

