wodecoin/mm32f5270_nano_frame/base/library/MM32F5270/HAL_Lib/Inc/hal_enet.h
#define ETH_MAC_AddressFilter_SA                         ((uint32_t)0x00000000)
#define ETH_MAC_AddressFilter_DA                         ((uint32_t)0x00000008)

#define ETH_MAC_AddressMask_Byte6                        ((uint32_t)0x20000000) ///< Mask MAC Address high reg bits [15:8]
#define ETH_MAC_AddressMask_Byte5                        ((uint32_t)0x10000000) ///< Mask MAC Address high reg bits [7:0]
#define ETH_MAC_AddressMask_Byte4                        ((uint32_t)0x08000000) ///< Mask MAC Address low reg bits [31:24]
#define ETH_MAC_AddressMask_Byte3                        ((uint32_t)0x04000000) ///< Mask MAC Address low reg bits [23:16]
#define ETH_MAC_AddressMask_Byte2                        ((uint32_t)0x02000000) ///< Mask MAC Address low reg bits [15:8]
#define ETH_MAC_AddressMask_Byte1                        ((uint32_t)0x01000000) ///< Mask MAC Address low reg bits [70]

//////////////////////////////////////////////////////////////////////////////
#define ETH_DMA_TDES_LastSegment                         ((uint32_t)0x40000000) ///< Last Segment
#define ETH_DMA_TDES_FirstSegment                        ((uint32_t)0x20000000) ///< First Segment

#define ETH_DMA_TDES_ChecksumByPass                      ((uint32_t)0x00000000) ///< Checksum engine bypass
#define ETH_DMA_TDES_ChecksumIPV4Header                  ((uint32_t)0x00400000) ///< IPv4 header checksum insertion
#define ETH_DMA_TDES_ChecksumTCPUDPICMPSegment           ((uint32_t)0x00800000) ///< TCP/UDP/ICMP checksum insertion. Pseudo header checksum is assumed to be present
#define ETH_DMA_TDES_ChecksumTCPUDPICMPFull              ((uint32_t)0x00C00000) ///< TCP/UDP/ICMP checksum fully in hardware including pseudo header

#define ETH_DMA_RDES_Buffer1                             ((uint32_t)0x00000000) ///< DMA Rx Desc Buffer1
#define ETH_DMA_RDES_Buffer2                             ((uint32_t)0x00000001) ///< DMA Rx Desc Buffer2

#define ETH_DropTCPIPChecksumErrorFrame_Enable           ((uint32_t)0x00000000)
#define ETH_DropTCPIPChecksumErrorFrame_Disable          ((uint32_t)0x04000000)

#define ETH_ReceiveStoreForward_Enable                   ((uint32_t)0x02000000)
#define ETH_ReceiveStoreForward_Disable                  ((uint32_t)0x00000000)

#define ETH_FlushReceivedFrame_Enable                    ((uint32_t)0x00000000)
#define ETH_FlushReceivedFrame_Disable                   ((uint32_t)0x01000000)

#define ETH_TransmitStoreForward_Enable                  ((uint32_t)0x00200000)
#define ETH_TransmitStoreForward_Disable                 ((uint32_t)0x00000000)

#define ETH_TransmitThresholdControl_64Bytes             ((uint32_t)0x00000000) ///< threshold level of the MTL Transmit FIFO is 64 Bytes
#define ETH_TransmitThresholdControl_128Bytes            ((uint32_t)0x00004000) ///< threshold level of the MTL Transmit FIFO is 128 Bytes
#define ETH_TransmitThresholdControl_192Bytes            ((uint32_t)0x00008000) ///< threshold level of the MTL Transmit FIFO is 192 Bytes
#define ETH_TransmitThresholdControl_256Bytes            ((uint32_t)0x0000C000) ///< threshold level of the MTL Transmit FIFO is 256 Bytes
#define ETH_TransmitThresholdControl_40Bytes             ((uint32_t)0x00010000) ///< threshold level of the MTL Transmit FIFO is 40 Bytes
#define ETH_TransmitThresholdControl_32Bytes             ((uint32_t)0x00014000) ///< threshold level of the MTL Transmit FIFO is 32 Bytes
#define ETH_TransmitThresholdControl_24Bytes             ((uint32_t)0x00018000) ///< threshold level of the MTL Transmit FIFO is 24 Bytes
#define ETH_TransmitThresholdControl_16Bytes             ((uint32_t)0x0001C000) ///< threshold level of the MTL Transmit FIFO is 16 Bytes

#define ETH_ForwardErrorFrames_Enable                    ((uint32_t)0x00000080)
#define ETH_ForwardErrorFrames_Disable                   ((uint32_t)0x00000000)

#define ETH_ForwardUndersizedGoodFrames_Enable           ((uint32_t)0x00000040)
#define ETH_ForwardUndersizedGoodFrames_Disable          ((uint32_t)0x00000000)

#define ETH_ReceiveThresholdControl_64Bytes              ((uint32_t)0x00000000) ///< threshold level of the MTL Receive FIFO is 64 Bytes
#define ETH_ReceiveThresholdControl_32Bytes              ((uint32_t)0x00000008) ///< threshold level of the MTL Receive FIFO is 32 Bytes
#define ETH_ReceiveThresholdControl_96Bytes              ((uint32_t)0x00000010) ///< threshold level of the MTL Receive FIFO is 96 Bytes
#define ETH_ReceiveThresholdControl_128Bytes             ((uint32_t)0x00000018) ///< threshold level of the MTL Receive FIFO is 128 Bytes

#define ETH_SecondFrameOperate_Enable                    ((uint32_t)0x00000004)
#define ETH_SecondFrameOperate_Disable                   ((uint32_t)0x00000000)

#define ETH_AddressAlignedBeats_Enable                   ((uint32_t)0x02000000)
#define ETH_AddressAlignedBeats_Disable                  ((uint32_t)0x00000000)

#define ETH_FixedBurst_Enable                            ((uint32_t)0x00010000)
#define ETH_FixedBurst_Disable                           ((uint32_t)0x00000000)

#define ETH_RxDMABurstLength_1Beat                       ((uint32_t)0x00020000) ///< maximum number of beats to be transferred in one RxDMA transaction is 1
#define ETH_RxDMABurstLength_2Beat                       ((uint32_t)0x00040000) ///< maximum number of beats to be transferred in one RxDMA transaction is 2
#define ETH_RxDMABurstLength_4Beat                       ((uint32_t)0x00080000) ///< maximum number of beats to be transferred in one RxDMA transaction is 4
#define ETH_RxDMABurstLength_8Beat                       ((uint32_t)0x00100000) ///< maximum number of beats to be transferred in one RxDMA transaction is 8
#define ETH_RxDMABurstLength_16Beat                      ((uint32_t)0x00200000) ///< maximum number of beats to be transferred in one RxDMA transaction is 16
#define ETH_RxDMABurstLength_32Beat                      ((uint32_t)0x00400000) ///< maximum number of beats to be transferred in one RxDMA transaction is 32
#define ETH_RxDMABurstLength_4xPBL_4Beat                 ((uint32_t)0x01020000) ///< maximum number of beats to be transferred in one RxDMA transaction is 4
#define ETH_RxDMABurstLength_4xPBL_8Beat                 ((uint32_t)0x01040000) ///< maximum number of beats to be transferred in one RxDMA transaction is 8
#define ETH_RxDMABurstLength_4xPBL_16Beat                ((uint32_t)0x01080000) ///< maximum number of beats to be transferred in one RxDMA transaction is 16
#define ETH_RxDMABurstLength_4xPBL_32Beat                ((uint32_t)0x01100000) ///< maximum number of beats to be transferred in one RxDMA transaction is 32
#define ETH_RxDMABurstLength_4xPBL_64Beat                ((uint32_t)0x01200000) ///< maximum number of beats to be transferred in one RxDMA transaction is 64
#define ETH_RxDMABurstLength_4xPBL_128Beat               ((uint32_t)0x01400000) ///< maximum number of beats to be transferred in one RxDMA transaction is 128

#define ETH_TxDMABurstLength_1Beat                       ((uint32_t)0x00000100) ///< maximum number of beats to be transferred in one TxDMA (or both) transaction is 1
#define ETH_TxDMABurstLength_2Beat                       ((uint32_t)0x00000200) ///< maximum number of beats to be transferred in one TxDMA (or both) transaction is 2
#define ETH_TxDMABurstLength_4Beat                       ((uint32_t)0x00000400) ///< maximum number of beats to be transferred in one TxDMA (or both) transaction is 4
#define ETH_TxDMABurstLength_8Beat                       ((uint32_t)0x00000800) ///< maximum number of beats to be transferred in one TxDMA (or both) transaction is 8
#define ETH_TxDMABurstLength_16Beat                      ((uint32_t)0x00001000) ///< maximum number of beats to be transferred in one TxDMA (or both) transaction is 16
#define ETH_TxDMABurstLength_32Beat                      ((uint32_t)0x00002000) ///< maximum number of beats to be transferred in one TxDMA (or both) transaction is 32
#define ETH_TxDMABurstLength_4xPBL_4Beat                 ((uint32_t)0x01000100) ///< maximum number of beats to be transferred in one TxDMA (or both) transaction is 4
#define ETH_TxDMABurstLength_4xPBL_8Beat                 ((uint32_t)0x01000200) ///< maximum number of beats to be transferred in one TxDMA (or both) transaction is 8
#define ETH_TxDMABurstLength_4xPBL_16Beat                ((uint32_t)0x01000400) ///< maximum number of beats to be transferred in one TxDMA (or both) transaction is 16
#define ETH_TxDMABurstLength_4xPBL_32Beat                ((uint32_t)0x01000800) ///< maximum number of beats to be transferred in one TxDMA (or both) transaction is 32
#define ETH_TxDMABurstLength_4xPBL_64Beat                ((uint32_t)0x01001000) ///< maximum number of beats to be transferred in one TxDMA (or both) transaction is 64
#define ETH_TxDMABurstLength_4xPBL_128Beat               ((uint32_t)0x01002000) ///< maximum number of beats to be transferred in one TxDMA (or both) transaction is 128

